app/controllers/welcome_controller.rb

  def index
    @notes_count = Note.count
---
SELECT COUNT(*) FROM "notes"